app/views/users/_form.html.erb

    <%= f.label :role_id %><br>
   <%= collection_select(:user, :role_id, Role.all, :id, :name, {prompt: true}) %>
---
SELECT "roles".* FROM "roles"