app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "courses"
---
  def index
   @courses = Course.all.paginate(page: params[:page], per_page:3)

INSERT INTO "courses" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "system verilog"], ["description", "checking the user"], ["price", 999.0], ["user_id", 1], ["created_at", "2016-07-23 12:07:40.621188"], ["updated_at", "2016-07-23 12:07:40.621188"]]
---
  def create
    @course.user_id = current_user.id

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "courses"."id" = ?
---
  def update
    respond_to do |format|
      if @course.update(course_params)