app/controllers/users_controller.rb

  def create


    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "name", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update

 if user_params[:password].blank?
    user_params.delete(:password)
    user_params.delete(:password_confirmation)
  end

  successfully_updated = if needs_password?(@user, user_params)
                           @user.update(user_params)
---
UPDATE "users" SET "role_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role_id", 3], ["updated_at", "2016-07-23 07:20:18.773074"], ["id", 1]]